import numpy as np


def example_transform_matrix_add_row():
    A = np.array([
        [1,  2,  3,  4,  5],
        [6,  7,  8,  9,  10],
        [11, 12, 13, 14, 15],
        [16, 17, 18, 19, 20],
        [21, 22, 23, 24, 25],
    ])
    T = np.array([
        [1, 0, 0, 0, 0],
        [0, 1, 0, 1, 0],  # i = 1, j = 3
        [0, 0, 1, 0, 0],
        [0, 0, 0, 1, 0],
        [0, 0, 0, 0, 1],
    ])

    print(A)
    print(T @ A)  # к строке с индексом i=1 прибавляем строку с индексом j=3
    print(A @ T)  # к столбцу с индексом j=3 прибавляем столбец с индексом i=1

    Ti = np.array([
        [1, 0, 0, 0, 0],
        [0, 1, 0, -1, 0],  # i = 1, j = 3
        [0, 0, 1, 0, 0],
        [0, 0, 0, 1, 0],
        [0, 0, 0, 0, 1],
    ])

    print(Ti @ T)  # Обратная матрица к T (можно использовать для обратного преобразования)


def example_transform_matrix_swap_rows():
    A = np.array([
        [1, 2, 3, 4, 5],
        [6, 7, 8, 9, 10],
        [11, 12, 13, 14, 15],
        [16, 17, 18, 19, 20],
        [21, 22, 23, 24, 25],
    ])
    T = np.array([
        [1, 0, 0, 0, 0],
        [0, 0, 0, 0, 1],  # i = 1, j = 4
        [0, 0, 1, 0, 0],
        [0, 0, 0, 1, 0],
        [0, 1, 0, 0, 0],  # i = 4, j = 1
    ])

    print(A)
    print(T @ A)  # меняем местами строки с индексами 1 и 4
    print(A @ T)  # меняем местами столбцы с индексами 1 и 4

    Ti = T
    print(Ti @ T)  # Обратная матрица к T (можно использовать для обратного преобразования)


def example_transform_matrix_mul_row():
    A = np.array([
        [1, 2, 3, 4, 5],
        [6, 7, 8, 9, 10],
        [11, 12, 13, 14, 15],
        [16, 17, 18, 19, 20],
        [21, 22, 23, 24, 25],
    ])
    T = np.array([
        [1, 0, 0, 0, 0],
        [0, 1, 0, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 0, 2, 0],  # i = 3, множитель = 2
        [0, 0, 0, 0, 1],
    ])

    print(A)
    print(T @ A)  # умножаем строку с индексом 3 на 2
    print(A @ T)  # умножаем строку с индексом 3 на 2

    Ti = np.array([
        [1, 0, 0, 0, 0],
        [0, 1, 0, 0, 0],
        [0, 0, 1, 0, 0],
        [0, 0, 0, 1/2, 0],  # i = 3, множитель = 1/2
        [0, 0, 0, 0, 1],
    ])
    print(Ti @ T)  # Обратная матрица к T (можно использовать для обратного преобразования)
